// Циклы 

// Циклы предусмотрены для многократного выполнения одного и тогоже отрезка кода

///// Цикл WHILE

// Синтаксис
/*while (условие) {
     Тело цикла
     Тут будет выполнятся код 
}
*/

// Пример
// let num = 0;
// while (num < 5) {
//     console.log(num);
//     num++;
// }

// let num = 5;
// while (num) {
//     console.log(num);
//     num--;
// }

// true - есть итерация; false - нет итерации;

// если тело цикла состоит из одной строки, то фигурные скодки можем опустить

let num = 5;
while (num) console.log(num--);