// Математические операторы

let x;
// Сложение +
x = 5 + 8;
console.log(`Результат сложения: ${x}`);

// Вычитание -
x = 9 - 5;
console.log(`Результат : ${x}`);

// Умножение *
x = 2 * 3;
console.log(`Результат : ${x}`);

// Деление /
x = 10 / 2;
console.log(`Результат : ${x}`);

// Взятие остатка от деления %
x = 11 % 3;
console.log(`Результат взятия остатка от деления: ${x}`);
// Проверка 11=3*3(неполное частное от деления)+(остаток)

// Возведение в степень **
x = 5 ** 3;
console.log(`: ${x}`);