/*Операторы могут быть 2х типо: "унарные" и "бинарные"
Отличаются они по кол-ву операндов
Операнд - то к чему применяется применяются операторы (аргументы).
простыми словами - строки, числа, переменные и константы и прочие обьекты которые участвуют в выражении.
*/

// Примеры
let userAge = 30 - 6; // Числа 30 и 6 - это операнды
// либо
let userHeight = h - y; // Переменные - это операнды 

/*
Бинарными называются операнды которые применяются к 2м операндам.
В нашем примере вычитание -, это бинарный оператор
*/
let userAge = 30 - 6;
/*
Унарным считается оператор, который применен только к одному операнду, например
*/
let userCash = -800;