
// События
/*
События - одна из самых важных тем.
Это сигнал поступающий от браузера о том, что что-то произошло, клик мыши, 
прокрутка скролла, нажатие клавиш на клавиатуре, загрузка страницы... эти и 
многие другие события мы можем отлавливать и когда они возникают - выполнять 
нужные нам действия.

Отлавливать возникновение события мы будем с помощью специальных обработчиков.

Любому событию можно назначить обработчик, то есть функцию, которая сработает, 
как только произойдет нужное нам событие. Именно благодаря этим обработчикам 
ДЖС может реагировать на действия пользователя.

Есть несколько способов назначить событию обработчик.
*/