// Синтаксис

let  message = "Hello, Aleks!";
// let first = 5;
// let second = 10;

// if (first === second) {
//     // Код внутри {} выполняется только если 
//     // выражение в () вернет true
//     console.log(message);
// }

// Более сложное условие
// if (2 + 1 === 3 && "1" == 1 || 10 > 5 && 10 ===1) {
//     console.log(message);
// }


/// Преобразование типов
// if ("") {
//     console.log(message);
// }

/// Более короткая запись
// Код выполняется только если 
//выражение в скобках вернет true
if (2 > 1) console.log(message);/*
В случае если при определенном условии нам нужно 
выполнить всего одну инструкцию, то можно использовать такую запись.
В других случаях стоит использовать класическую запись с фигурными скобками*/
 