//  Цикл WHILE

// Конструкция DO...WHILE

let num = 0;
do {
    console.log(num);
    num++;
} while (num < 5);

/*
Пишем do открываем фиругные скобки и внутри записываем тело 
цикла, а уже после закрывающей фигурной скобки пишем while и условие.
Этот способ стоит использовать тогда, когда необходимо хотя-бы ОДНО 
выполнение тела цикла вне зависимости от того вернет условие true или нет.


На практике чаще всего используется обычный цикл while, где тело цикла 
выполняется только после удовлетворения условия.
*/